app/views/users/show.html.erb

<p>Followers: <%= @user.followers.size%></p>
<p>Following: <%= @user.followings.size%></p>
<p>Recently Watched:  </p>
<% @user.views.each do |view| %>
---
SELECT COUNT(*) FROM "followings" WHERE "followings"."user_id" = ?  [["user_id", 1]]
SELECT "views".* FROM "views" WHERE "views"."user_id" = ?  [["user_id", 1]]