app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
---
  def current_user
    @user = (User.find_by(id: session[:user_id]) || User.new)