app/controllers/comments_controller.rb

    def create
        @comment = Comment.create(comment_params)
---
INSERT INTO "comments" ("user_id", "episode_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["episode_id", 742], ["comment", "rtfegregfge"], ["created_at", "2019-10-22 21:16:05.331202"], ["updated_at", "2019-10-22 21:16:05.331202"]]