app/controllers/episodes_controller.rb

    def show
        @episode = Episode.find(params[:id])
        @comments = @episode.comments
        @show = @episode.season.show
        @views = View.all
        @watch = Watch.find_or_create_by(user_id: session[:user_id], episode_id: @episode.id)
---
SELECT "episodes".* FROM "episodes" WHERE "episodes"."id" = ? LIMIT ?  [["id", 742], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "episode_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["episode_id", 742], ["created_at", "2019-10-23 18:36:44.912706"], ["updated_at", "2019-10-23 18:36:44.912706"]]
SELECT "comments".* FROM "comments" WHERE "comments"."episode_id" = ? AND "comments"."user_id" = ? AND "comments"."episode_id" = ? LIMIT ?  [["episode_id", 742], ["user_id", 1], ["episode_id", 742], ["LIMIT", 1]]
SELECT "seasons".* FROM "seasons" WHERE "seasons"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]
SELECT "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT ?  [["id", 36], ["LIMIT", 1]]