app/controllers/shows_controller.rb

    def show
        @show = Show.find(params[:id])
        if @show.views.find{|view| view.user_id == session[:user_id]}
            @view = @show.views.find{|view| view.user_id == session[:user_id]}
        else
            @view = View.new
        end


        @watches = Watch.all.where(user_id: session[:user_id],watched: true)
---
SELECT "watches".* FROM "watches" WHERE "watches"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]