app/controllers/shows_controller.rb

SELECT "shows".* FROM "shows" WHERE "shows"."name" = ? LIMIT ?  [["name", "Game of Thrones"], ["LIMIT", 1]]
SELECT "shows"."name" FROM "shows"
---
    def index
        # if user input in params, show filtered results
        # otherwise show everything
        if search_shows != nil
            @shows = Show.find_by(name: params[:q])
            # redirect_to shows_path(@shows)
            render :index
        else
            @shows = Show.all.sort_by{ |show| show.created_at }

SELECT "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT ?  [["id", 40], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "views".* FROM "views" WHERE "views"."show_id" = ?  [["show_id", 40]]
SELECT "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def show
        in_database = Show.find(params[:id])
        TMDBApi.all_the_season_info(params[:id]) if !in_database.num_of_seasons
        @show = Show.find(params[:id])
        if @show.views.find{|view| view.user_id == session[:user_id]}
            @view = @show.views.find{|view| view.user_id == session[:user_id]}

SELECT "shows".* FROM "shows" WHERE "shows"."name" = ? LIMIT ?  [["name", "Game of Thrones"], ["LIMIT", 1]]
---
    def search_shows
        @shows = Show.find_by(name: params[:q])