app/controllers/users_controller.rb

INSERT INTO "users" ("user_name", "first_name", "last_name", "age", "password_digest", "phone_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @user = User.new(user_params)
        if @user.save

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$eit7pHyHlobRF05eZEWlXuSKW.ec0Z5LSsKNSf5w.Rf2y1RxcE2bm"], ["updated_at", "2019-10-22 02:26:55.156451"], ["id", 26]]
---
    def update
        @user.update(user_params)