app/controllers/watches_controller.rb

    def edit
        @watch = Watch.find(params[:id])
---
SELECT "watches".* FROM "watches" WHERE "watches"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def update
        @watch = Watch.find(params[:id])
        @watch.delete
---
SELECT "watches".* FROM "watches" WHERE "watches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "watches" WHERE "watches"."id" = ?  [["id", 1]]