app/views/shows/show.html.erb

        <%= form_with model: @watch do |f| %>
            <%= f.collection_check_boxes(:episode_ids, season.episodes, :id, :name, selected: @show.views.map{|view| view.episodes_watched if view.user_id == session[:user_id]} )  do |b| %>
---
SELECT "views".* FROM "views" WHERE "views"."show_id" = ?  [["show_id", 36]]
SELECT "episodes".* FROM "episodes" WHERE "episodes"."season_id" = ?  [["season_id", 33]]
SELECT "watches".* FROM "watches" WHERE "watches"."user_id" = ? AND "watches"."watched" = ?  [["user_id", 1], ["watched", 1]]

    <% else%>
        <% season.episodes.each do |episode| %>
---
SELECT "episodes".* FROM "episodes" WHERE "episodes"."season_id" = ?  [["season_id", 33]]